; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	instrument2 - instrument
	satellite2 - satellite
	instrument3 - instrument
	satellite3 - satellite
	instrument4 - instrument
	satellite4 - satellite
	instrument5 - instrument
	spectrograph5 - mode
	image2 - mode
	spectrograph3 - mode
	infrared1 - mode
	thermograph0 - mode
	image4 - mode
	Star4 - direction
	GroundStation3 - direction
	Star2 - direction
	GroundStation1 - direction
	GroundStation0 - direction
	Phenomenon5 - direction
	Phenomenon6 - direction
	Star7 - direction
	Phenomenon8 - direction
	Phenomenon9 - direction
	Star10 - direction
	Phenomenon11 - direction
)
(:init
	(supports instrument0 infrared1)
	(supports instrument0 image2)
	(calibration_target instrument0 Star4)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Phenomenon11)
	(supports instrument1 spectrograph3)
	(supports instrument1 thermograph0)
	(calibration_target instrument1 GroundStation3)
	(supports instrument2 image4)
	(supports instrument2 spectrograph5)
	(supports instrument2 thermograph0)
	(calibration_target instrument2 GroundStation3)
	(on_board instrument1 satellite1)
	(on_board instrument2 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star4)
	(supports instrument3 spectrograph3)
	(supports instrument3 image2)
	(calibration_target instrument3 Star2)
	(on_board instrument3 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star2)
	(supports instrument4 spectrograph5)
	(supports instrument4 spectrograph3)
	(calibration_target instrument4 GroundStation1)
	(on_board instrument4 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Phenomenon9)
	(supports instrument5 spectrograph5)
	(supports instrument5 image2)
	(calibration_target instrument5 GroundStation0)
	(on_board instrument5 satellite4)
	(power_avail satellite4)
	(pointing satellite4 Phenomenon5)
)
(:goal (and
	(pointing satellite0 Star2)
	(pointing satellite1 Phenomenon5)
	(pointing satellite3 Star2)
	(have_image Phenomenon5 image4)
	(have_image Phenomenon6 spectrograph5)
	(have_image Phenomenon6 spectrograph3)
	(have_image Star7 infrared1)
	(have_image Phenomenon8 thermograph0)
	(have_image Phenomenon9 spectrograph3)
	(have_image Phenomenon9 thermograph0)
	(have_image Star10 spectrograph3)
	(have_image Phenomenon11 image4)
	(have_image Phenomenon11 image2)
))

)

; plan
1. (turn_to satellite3 star2 phenomenon9)
   deleted: (pointing satellite3 phenomenon9)
   added: (pointing satellite3 star2)
   goals met: 1 of 13
2. (switch_on instrument3 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument3)
   goals met: 1 of 13
3. (calibrate satellite2 instrument3 star2)
   added: (calibrated instrument3)
   goals met: 1 of 13
4. (turn_to satellite2 phenomenon9 star2)
   deleted: (pointing satellite2 star2)
   added: (pointing satellite2 phenomenon9)
   goals met: 1 of 13
5. (take_image satellite2 phenomenon9 instrument3 spectrograph3)
   added: (have_image phenomenon9 spectrograph3)
   goals met: 2 of 13
6. (turn_to satellite2 phenomenon6 phenomenon9)
   deleted: (pointing satellite2 phenomenon9)
   added: (pointing satellite2 phenomenon6)
   goals met: 2 of 13
7. (take_image satellite2 phenomenon6 instrument3 spectrograph3)
   added: (have_image phenomenon6 spectrograph3)
   goals met: 3 of 13
8. (turn_to satellite2 phenomenon11 phenomenon6)
   deleted: (pointing satellite2 phenomenon6)
   added: (pointing satellite2 phenomenon11)
   goals met: 3 of 13
9. (turn_to satellite1 groundstation3 star4)
   deleted: (pointing satellite1 star4)
   added: (pointing satellite1 groundstation3)
   goals met: 3 of 13
10. (turn_to satellite0 star4 phenomenon11)
   deleted: (pointing satellite0 phenomenon11)
   added: (pointing satellite0 star4)
   goals met: 3 of 13
11. (take_image satellite2 phenomenon11 instrument3 image2)
   added: (have_image phenomenon11 image2)
   goals met: 4 of 13
12. (switch_on instrument2 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument2)
   goals met: 4 of 13
13. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 4 of 13
14. (calibrate satellite1 instrument2 groundstation3)
   added: (calibrated instrument2)
   goals met: 4 of 13
15. (calibrate satellite0 instrument0 star4)
   added: (calibrated instrument0)
   goals met: 4 of 13
16. (turn_to satellite0 star7 star4)
   deleted: (pointing satellite0 star4)
   added: (pointing satellite0 star7)
   goals met: 4 of 13
17. (take_image satellite0 star7 instrument0 infrared1)
   added: (have_image star7 infrared1)
   goals met: 5 of 13
18. (turn_to satellite0 star2 star7)
   deleted: (pointing satellite0 star7)
   added: (pointing satellite0 star2)
   goals met: 6 of 13
19. (turn_to satellite1 phenomenon11 groundstation3)
   deleted: (pointing satellite1 groundstation3)
   added: (pointing satellite1 phenomenon11)
   goals met: 6 of 13
20. (take_image satellite1 phenomenon11 instrument2 image4)
   added: (have_image phenomenon11 image4)
   goals met: 7 of 13
21. (turn_to satellite1 phenomenon6 phenomenon11)
   deleted: (pointing satellite1 phenomenon11)
   added: (pointing satellite1 phenomenon6)
   goals met: 7 of 13
22. (take_image satellite1 phenomenon6 instrument2 spectrograph5)
   added: (have_image phenomenon6 spectrograph5)
   goals met: 8 of 13
23. (turn_to satellite1 phenomenon8 phenomenon6)
   deleted: (pointing satellite1 phenomenon6)
   added: (pointing satellite1 phenomenon8)
   goals met: 8 of 13
24. (take_image satellite1 phenomenon8 instrument2 thermograph0)
   added: (have_image phenomenon8 thermograph0)
   goals met: 9 of 13
25. (turn_to satellite1 phenomenon9 phenomenon8)
   deleted: (pointing satellite1 phenomenon8)
   added: (pointing satellite1 phenomenon9)
   goals met: 9 of 13
26. (take_image satellite1 phenomenon9 instrument2 thermograph0)
   added: (have_image phenomenon9 thermograph0)
   goals met: 10 of 13
27. (turn_to satellite1 phenomenon5 phenomenon9)
   deleted: (pointing satellite1 phenomenon9)
   added: (pointing satellite1 phenomenon5)
   goals met: 11 of 13
28. (take_image satellite1 phenomenon5 instrument2 image4)
   added: (have_image phenomenon5 image4)
   goals met: 12 of 13
29. (turn_to satellite2 star10 phenomenon11)
   deleted: (pointing satellite2 phenomenon11)
   added: (pointing satellite2 star10)
   goals met: 12 of 13
30. (take_image satellite2 star10 instrument3 spectrograph3)
   added: (have_image star10 spectrograph3)
   goals met: 13 of 13
